IDENTIFICATION DIVISION.
PROGRAM-ID. P2.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IN-FILE  ASSIGN TO "P2In.dat" ORGANIZATION IS LINE SEQUENTIAL.
    SELECT OUT-FILE ASSIGN TO "P2Out.dat" ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD IN-FILE.
01 IN-RECORD.
    02 IN-NAME              PIC A(19).
    02 IN-W-NUMBER          PIC X(10).
    02 IN-SEMESTER          PIC X(13).
    02 IN-COURSE            PIC X(13).
    02 IN-DESCRIPTION       PIC X(30).
    02 IN-GRADE             PIC A.
FD OUT-FILE.
01 OUT-RECORD.
    02 OUT-NAME             PIC A(19).

WORKING-STORAGE SECTION.
01 EOF                      PIC A VALUE "N".

PROCEDURE DIVISION.
MAIN-LOGIC SECTION.
PROGRAM-BEGIN.

    PERFORM OPENING-PROCEDURE.
    PERFORM READ-NEXT-RECORD.
    PERFORM WRITE-RECORD
        UNTIL EOF = "Y".
    PERFORM CLOSING-PROCEDURE.

PROGRAM-DONE.
    STOP RUN.

OPENING-PROCEDURE.
    OPEN INPUT IN-FILE.
    OPEN OUTPUT OUT-FILE.

CLOSING-PROCEDURE.
    CLOSE OUT-FILE.
    CLOSE IN-FILE.

READ-NEXT-RECORD.
    READ IN-FILE NEXT RECORD
        AT END
            MOVE "Y" TO EOF.

WRITE-RECORD.
    MOVE IN-NAME TO OUT-NAME.
    WRITE OUT-RECORD.
    PERFORM READ-NEXT-RECORD.
