IDENTIFICATION DIVISION.
PROGRAM-ID. P2.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IN-FILE ASSIGN TO "P2In.dat"
        ORGANIZATION IS LINE SEQUENTIAL.
    SELECT OUT-FILE ASSIGN TO "P2Out.dat"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD IN-FILE.
01 IN-RECORD.
    05 STUDENT-NAME     PIC A(19).
    05 STUDENT-NUMBER   PIC X(10).
    05 SEMESTER         PIC X(15).
    05 COURSE           PIC X(15).
    05 COURSE-TITLE     PIC X(30).
    05 GRADE            PIC A(5).
    05 EARNED           PIC 9.99.
FD OUT-FILE.
01 OUT-SCHOOL-NAME      PIC A(80).
01 OUT-SCHOOL-ADDR      PIC X(80).
01 OUT-SPACE            PIC A.
01 OUT-STUDENT-NAME     PIC A(19).
01 OUT-STUDENT-NUMBER   PIC X(10).
01 OUT-SEMESTER         PIC X(15).
01 OUT-LABELS.
    05 FILLER           PIC X(15).
    05 FILLER           PIC X(30).
    05 FILLER           PIC A(5).
    05 FILLER           PIC A(11).
    05 FILLER           PIC AAAA.

WORKING-STORAGE SECTION.
01 WS-SCHOOL-NAME       PIC A(80) VALUE "SOUTHEASTERN LOUISIANA UNIVSERITY".
01 WS-SCHOOL-ADDR       PIC X(80) VALUE "HAMMOND, LA 70402".
01 WS-SPACE             PIC A VALUE SPACE.
01 WS-LABELS.
    05 FILLER           PIC X(15)       VALUE "COURSE".
    05 FILLER           PIC X(30)       VALUE "TITLE".
    05 FILLER           PIC A(5)        VALUE "GR".
    05 FILLER           PIC A(11)       VALUE "EARNED".
    05 FILLER           PIC AAAA        VALUE "QPTS".
01 EOF                  PIC A           VALUE "N".
01 WS-SEMESTER          PIC X(15).

PROCEDURE DIVISION.
MAIN-LOGIC SECTION.
PROGRAM-BEGIN.

    PERFORM OPENING-PROCEDURE.
    PERFORM WRITE-DISPLAY-REPORT.
    PERFORM CLOSING-PROCEDURE.

PROGRAM-DONE.
    STOP RUN.

OPENING-PROCEDURE.
    OPEN INPUT IN-FILE.
    OPEN OUTPUT OUT-FILE.

CLOSING-PROCEDURE.
    CLOSE IN-FILE, OUT-FILE.

READ-NEXT-RECORD.
    READ IN-FILE NEXT RECORD
        AT END
            MOVE "Y" TO EOF.

WRITE-DISPLAY-REPORT.
    PERFORM READ-NEXT-RECORD.
    MOVE SEMESTER TO WS-SEMESTER.

    PERFORM WRITE-HEADER.
    PERFORM DISPLAY-HEADER.

WRITE-HEADER.
    WRITE OUT-SCHOOL-NAME FROM WS-SCHOOL-NAME.
    WRITE OUT-SCHOOL-ADDR FROM WS-SCHOOL-ADDR.
    WRITE OUT-SPACE FROM WS-SPACE.

    WRITE OUT-STUDENT-NAME FROM STUDENT-NAME.
    WRITE OUT-STUDENT-NUMBER FROM STUDENT-NUMBER.
    WRITE OUT-SPACE FROM WS-SPACE.

    WRITE OUT-SEMESTER FROM WS-SEMESTER.
    WRITE OUT-LABELS FROM WS-LABELS.
    WRITE OUT-SPACE FROM WS-SPACE.

DISPLAY-HEADER.
    DISPLAY WS-SCHOOL-NAME.
    DISPLAY WS-SCHOOL-ADDR.
    DISPLAY WS-SPACE.

    DISPLAY STUDENT-NAME.
    DISPLAY STUDENT-NUMBER.
    DISPLAY WS-SPACE.

    DISPLAY WS-SEMESTER.
    DISPLAY WS-LABELS.
    DISPLAY WS-SPACE.
