IDENTIFICATION DIVISION.
PROGRAM-ID. P2.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IN-FILE  ASSIGN TO "P2In.dat".
    SELECT OUT-FILE ASSIGN TO "P2Out.dat".

DATA DIVISION.
FILE SECTION.
FD IN-FILE.
01 IN-RECORD.
    02 NAME             PIC A(19).
    02 W-NUMBER         PIC X(9).

    02 SEMESTER         PIC X(19).

    02 COURSE           PIC X(19).
    02 DESCRIPTION      PIC X(29).
    02 GRADE            PIC A(1).
FD OUT-FILE.
01 OUT-RECORD.

WORKING-STORAGE SECTION.
01 EOF PIC X(3) VALUE "NO".

PROCEDURE DIVISION.
    OPEN INPUT IN-FILE.
    OPEN OUTPUT OUT-FILE.
    PERFORM SUB-READ
    PERFORM UNTIL EOF = "YES"
        DISPLAY NAME, W-NUMBER, SEMESTER, COURSE, DESCRIPTION, GRADE.