IDENTIFICATION DIVISION.
PROGRAM-ID. TVar.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 m    PICTURE XXXX.
01 n    PIC X(4).
01 o    PIC AAAA VALUE "DEFG".
01 p    PIC A(4) VALUE SPACES.
01 q    PIC 99.99 VALUE ZEROS.
01 r    PIC 99.99.
PROCEDURE DIVISION.
    MOVE "ABCD" TO m.
    MOVE 1234 TO n.
    MOVE "HIJK" TO p.
    MOVE 12.34 TO q.
    MOVE 56.78 TO r.
    DISPLAY m.
    DISPLAY n.
    DISPLAY o.
    DISPLAY p.
    DISPLAY q.
    DISPLAY r.
    STOP RUN.
